In [2]:
import pandas as pd
import numpy as np

In [3]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [11]:
obj[[0, 2]]

a    0.0
c    2.0
dtype: float64

In [17]:
obj[1 < obj]

c    2.0
d    3.0
dtype: float64

In [18]:
data = pd.DataFrame(np.arange(16).reshape((4,4)),
index=['Ohio', 'Colorado', 'Utah', 'New York'],
columns=['one', 'two', 'three', 'four'])

In [19]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [44]:
data.iloc[:, :1][data.three > 5]

          one
Colorado    0
Utah        8
New York   12

In [36]:
data.loc[: 'Utah','two'] # 처음부터 유타까지(유타포함), two컬럼

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [35]:
data.iloc[[1,2],[3,0,1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [34]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [33]:
data.iloc[2, [3,0,1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [32]:
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int32

In [30]:
data[data < 5] = 0

In [31]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [26]:
data[data['three'] > 9]  #불리언배열로 로우선택

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [27]:
data['three'] > 9

Ohio        False
Colorado    False
Utah         True
New York     True
Name: three, dtype: bool

In [20]:
data['one']

Ohio         0
Colorado     4
Utah         8
New York    12
Name: one, dtype: int32

In [21]:
data[['one', 'three']]

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [24]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7